In [2]:
import pandas as pd
import datetime
import glob
from minio import Minio
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
client = Minio(
        "localhost:9000",
        access_key="minioadmin",
        secret_key="minioadmin",
        secure=False
    )

In [9]:
client.fget_object(
            "processing",
            "employeesDataset.parquet",
            "temp_.parquet",
)
df = pd.read_parquet("temp_.parquet")
df.head()

,Employee_Name,EmpID,MarriedID,MaritalStatusID,GenderID,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,Salary,...,ManagerName,ManagerID,RecruitmentSource,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,LastPerformanceReview_Date,DaysLateLast30,Absences
0,"Adinolfi, Wilson K",10026,0,0,1,1,5,4,0,62506,...,Michael Albert,22.0,LinkedIn,Exceeds,4.60,5,0,1/17/2019,0,1
1,"Ait Sidi, Karthikeyan",10084,1,1,1,5,3,3,0,104437,...,Simon Roup,4.0,Indeed,Fully Meets,4.96,3,6,2/24/2016,0,17
2,"Akinkuolie, Sarah",10196,1,1,0,5,5,3,0,64955,...,Kissy Sullivan,20.0,LinkedIn,Fully Meets,3.02,3,0,5/15/2012,0,3
3,"Alagbe,Trina",10088,1,1,0,1,5,3,0,64991,...,Elijiah Gray,16.0,Indeed,Fully Meets,4.84,5,0,1/3/2019,0,15
4,"Anderson, Carol",10069,0,2,0,5,5,3,0,50825,...,Webster Butler,39.0,Google Search,Fully Meets,5.00,4,0,2/1/2016,0,2

In [11]:
client.fget_object(
            "processing",
            "departmentSalaryTermd.parquet",
            "temp_.parquet",
)
df = pd.read_parquet("temp_.parquet")
df.head()

   EmpID         Department  Salary  Termd SalaryLevel
0  10026  Production          62506      0      medium
1  10084              IT/IS  104437      1        high
2  10196  Production          64955      1      medium
3  10088  Production          64991      0      medium
4  10069  Production          50825      1         low

In [14]:
client.fget_object(
            "processing",
            "meanWorkLast3Months.parquet",
            "temp_.parquet",
)
df = pd.read_parquet("temp_.parquet")
df

     EmpID  DaysLateLast30  Absences
0    10026               0         1
1    10084               0        17
2    10196               0         3
3    10088               0        15
4    10069               0         2
..     ...             ...       ...
306  10135               0        13
307  10301               5         4
308  10010               0        16
309  10043               0        11
310  10271               0         2

[311 rows x 3 columns]

In [15]:
client.fget_object(
            "processing",
            "numberSpecialProjects.parquet",
            "temp_.parquet",
)
df = pd.read_parquet("temp_.parquet")
df

     EmpID  SpecialProjectsCount
0    10026                     0
1    10084                     6
2    10196                     0
3    10088                     0
4    10069                     0
..     ...                   ...
306  10135                     0
307  10301                     0
308  10010                     6
309  10043                     5
310  10271                     0

[311 rows x 2 columns]

In [ ]:
client.fget_object(
            "processing",
            "timeInCompany.parquet",
            "temp_.parquet",
)
df = pd.read_parquet("temp_.parquet")
df

In [37]:

client.fget_object(
            "processing",
            "timeInCompany.parquet",
            "temp_.parquet",
)
df = pd.read_parquet("temp_.parquet")
df

    DateofHire  Termd DateofTermination  TimeInCompany
0     7/5/2011      0              None              8
1    3/30/2015      1         6/16/2016              2
2     7/5/2011      1         9/24/2012              2
3     1/7/2008      0              None             11
4    7/11/2011      1          9/6/2016              6
..         ...    ...               ...            ...
306   7/7/2014      0              None              5
307   9/2/2008      1         9/29/2015              8
308  4/10/2010      0              None              9
309  3/30/2015      0              None              4
310  9/29/2014      0              None              5

[311 rows x 4 columns]

In [34]:
from datetime import datetime

date_time_str = '7/5/2011'

date_time_obj = datetime.strptime(date_time_str, '%d/%m/%Y')


print ("The type of the date is now",  type(date_time_obj))
print ("The date is", date_time_obj)

The type of the date is now <class 'datetime.datetime'>
The date is 2011-05-07 00:00:00

In [36]:
from datetime import datetime

date_time_str = '6/16/2016'

date_time_obj = datetime.strptime(date_time_str, '%m/%d/%Y')


print ("The type of the date is now",  type(date_time_obj))
print ("The date is", date_time_obj)

The type of the date is now <class 'datetime.datetime'>
The date is 2016-06-16 00:00:00